---
kind: enumMember
id: F:Autodesk.Revit.DB.PartType.Sensor
enum: Autodesk.Revit.DB.PartType
source: html/4182a378-a3cc-7f0c-87b3-d230c2540267.htm
---
# Autodesk.Revit.DB.PartType.Sensor

Sensor part type